# SteelElemPlateShortenSuction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemPlateShortenSuction Property
ParameterTypeId Class See Also
---
"Suction"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemPlateShortenSuction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemPlateShortenSuction As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemPlateShortenSuction {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace